{
  "cat_vocabs": {
    "conn_state": {
      "OTH": 1,
      "REJ": 2,
      "RSTO": 3,
      "RSTOS0": 4,
      "RSTR": 5,
      "RSTRH": 6,
      "S0": 7,
      "S1": 8,
      "S2": 9,
      "S3": 10,
      "SF": 11,
      "SH": 12,
      "SHR": 13
    },
    "history": {
      "A": 1,
      "Aa": 2,
      "AaDd": 3,
      "Ar": 4,
      "C": 5,
      "CCC": 6,
      "CCCC": 7,
      "D": 8,
      "DAd": 9,
      "DFr": 10,
      "DRr": 11,
      "DT": 12,
      "DTT": 13,
      "D^": 14,
      "D^d": 15,
      "DaFfA": 16,
      "DadA": 17,
      "Dd": 18,
      "DdA": 19,
      "DdAFaf": 20,
      "DdAa": 21,
      "DdAaFf": 22,
      "DdAf": 23,
      "DdAtaFf": 24,
      "DdAtfFa": 25,
      "Dr": 26,
      "DrF": 27,
      "F": 28,
      "Fa": 29,
      "FaAr": 30,
      "FaR": 31,
      "FfA": 32,
      "Ffa": 33,
      "Fr": 34,
      "H": 35,
      "HWr": 36,
      "HaADdFf": 37,
      "HaDdAFTf": 38,
      "HaDdAFf": 39,
      "HaDdAfF": 40,
      "HaDdAr": 41,
      "HaDdR": 42,
      "HaDdTAFf": 43,
      "HaFfA": 44,
      "HaR": 45,
      "HadfDrArR": 46,
      "HafFr": 47,
      "Hr": 48,
      "HrR": 49,
      "I": 50,
      "R": 51,
      "S": 52,
      "SAD": 53,
      "SI": 54,
      "SaR": 55,
      "SahAdDF": 56,
      "ShA": 57,
      "ShAD": 58,
      "ShADCaGdFf": 59,
      "ShADCaGdfF": 60,
      "ShADF": 61,
      "ShADFa": 62,
      "ShADFaR": 63,
      "ShADFaT": 64,
      "ShADFaTdRf": 65,
      "ShADFaTdfR": 66,
      "ShADFaTdftR": 67,
      "ShADFaTf": 68,
      "ShADFaTfdtR": 69,
      "ShADFaTr": 70,
      "ShADFadR": 71,
      "ShADFadRf": 72,
      "ShADFadRfR": 73,
      "ShADFadRftr": 74,
      "ShADFadRtf": 75,
      "ShADFadfR": 76,
      "ShADFadfRR": 77,
      "ShADFadfRt": 78,
      "ShADFadftR": 79,
      "ShADFadtRf": 80,
      "ShADFaf": 81,
      "ShADFafR": 82,
      "ShADFafRdt": 83,
      "ShADFafdtR": 84,
      "ShADFafdtRR": 85,
      "ShADFar": 86,
      "ShADFarR": 87,
      "ShADFdRafR": 88,
      "ShADFdRf": 89,
      "ShADFdRt": 90,
      "ShADFdRtf": 91,
      "ShADFdafRR": 92,
      "ShADFdfR": 93,
      "ShADFdfaRR": 94,
      "ShADFfRaR": 95,
      "ShADFfa": 96,
      "ShADFfaRR": 97,
      "ShADFfdtaRR": 98,
      "ShADFfr": 99,
      "ShADFr": 100,
      "ShADFrRfaR": 101,
      "ShADFrfR": 102,
      "ShADa": 103,
      "ShADaF": 104,
      "ShADaFr": 105,
      "ShADaR": 106,
      "ShADacdFf": 107,
      "ShADacdftF": 108,
      "ShADacdtfF": 109,
      "ShADacdtfr": 110,
      "ShADacdtttfF": 111,
      "ShADacfF": 112,
      "ShADacfgF": 113,
      "ShADacgdFf": 114,
      "ShADad": 115,
      "ShADadF": 116,
      "ShADadFRR": 117,
      "ShADadFRfR": 118,
      "ShADadFf": 119,
      "ShADadFfRR": 120,
      "ShADadRRR": 121,
      "ShADadRf": 122,
      "ShADadf": 123,
      "ShADadfF": 124,
      "ShADadfFR": 125,
      "ShADadfFr": 126,
      "ShADadfR": 127,
      "ShADadfRr": 128,
      "ShADadfr": 129,
      "ShADadft": 130,
      "ShADadftF": 131,
      "ShADadftFR": 132,
      "ShADadr": 133,
      "ShADadtFRfR": 134,
      "ShADadtFf": 135,
      "ShADadtRf": 136,
      "ShADadtTfFr": 137,
      "ShADadtcfF": 138,
      "ShADadtctfF": 139,
      "ShADadtctfFR": 140,
      "ShADadtf": 141,
      "ShADadtfF": 142,
      "ShADadtfFr": 143,
      "ShADadtfRr": 144,
      "ShADadtftr": 145,
      "ShADadttFRfR": 146,
      "ShADadttFf": 147,
      "ShADadttWWtf": 148,
      "ShADadttcfF": 149,
      "ShADadttfF": 150,
      "ShADafF": 151,
      "ShADafdtF": 152,
      "ShADar": 153,
      "ShADdFaf": 154,
      "ShADdFf": 155,
      "ShADdaFr": 156,
      "ShADdaf": 157,
      "ShADdattFfR": 158,
      "ShADdf": 159,
      "ShADdfF": 160,
      "ShADdfFa": 161,
      "ShADdtaFf": 162,
      "ShADdtatFfR": 163,
      "ShADfr": 164,
      "ShADfrr": 165,
      "ShADr": 166,
      "ShADrfR": 167,
      "ShAF": 168,
      "ShAFa": 169,
      "ShAFaf": 170,
      "ShAFafr": 171,
      "ShAFar": 172,
      "ShAFf": 173,
      "ShAFfa": 174,
      "ShAFfar": 175,
      "ShAFr": 176,
      "ShAa": 177,
      "ShAaDdFf": 178,
      "ShAadDFR": 179,
      "ShAadDr": 180,
      "ShAaw": 181,
      "ShAaww": 182,
      "ShAdDaF": 183,
      "ShAdDaFR": 184,
      "ShAdDaFRR": 185,
      "ShAdDaFRf": 186,
      "ShAdDaFRfR": 187,
      "ShAdDaFRr": 188,
      "ShAdDaFT": 189,
      "ShAdDaFf": 190,
      "ShAdDaFfR": 191,
      "ShAdDaFr": 192,
      "ShAdDaFrR": 193,
      "ShAdDaR": 194,
      "ShAdDaRRR": 195,
      "ShAdDaRr": 196,
      "ShAdDaT": 197,
      "ShAdDaTFR": 198,
      "ShAdDaTFf": 199,
      "ShAdDaTR": 200,
      "ShAdDaTRf": 201,
      "ShAdDaTRft": 202,
      "ShAdDaTfF": 203,
      "ShAdDaTfRr": 204,
      "ShAdDaf": 205,
      "ShAdDafF": 206,
      "ShAdDafR": 207,
      "ShAdDafr": 208,
      "ShAdDaft": 209,
      "ShAdDaftF": 210,
      "ShAdDar": 211,
      "ShAdDatR": 212,
      "ShAdDfFa": 213,
      "ShAdDtaR": 214,
      "ShAdDtafF": 215,
      "ShAdaDR": 216,
      "ShAdaw": 217,
      "ShAdfDF": 218,
      "ShAdfDr": 219,
      "ShAdfF": 220,
      "ShAdfFa": 221,
      "ShAdfr": 222,
      "ShAdr": 223,
      "ShAdtfFa": 224,
      "ShAfF": 225,
      "ShAfFa": 226,
      "ShAfdtDr": 227,
      "ShAfdtF": 228,
      "ShAr": 229,
      "ShArR": 230,
      "ShDadAttt": 231,
      "ShR": 232,
      "ShrA": 233,
      "ShwA": 234,
      "ShwAaFdfR": 235,
      "ShwAr": 236,
      "ShwR": 237,
      "Sr": 238,
      "^aA": 239,
      "^c": 240,
      "^d": 241,
      "^dDA": 242,
      "^dtt": 243,
      "^f": 244,
      "^fA": 245,
      "^hR": 246,
      "^hRRRRRaR": 247,
      "^hRaRr": 248,
      "^hRr": 249,
      "^ha": 250,
      "^hwR": 251,
      "^r": 252
    },
    "service": {
      "dhcp": 1,
      "dns": 2,
      "http": 3,
      "ssh": 4,
      "ssl": 5
    }
  },
  "label_to_id": {
    "Benign": 0,
    "C&C-HeartBeat": 1,
    "DDoS": 2,
    "Okiru": 3,
    "C&C": 4,
    "Attack": 5,
    "C&C-HeartBeat-Attack": 6,
    "C&C-FileDownload": 7,
    "C&C-Torii": 8,
    "C&C-Mirai": 9,
    "C&C-HeartBeat-FileDownload": 10,
    "FileDownload": 11,
    "Okiru-Attack": 12
  },
  "id_to_label": {
    "0": "Benign",
    "1": "C&C-HeartBeat",
    "2": "DDoS",
    "3": "Okiru",
    "4": "C&C",
    "5": "Attack",
    "6": "C&C-HeartBeat-Attack",
    "7": "C&C-FileDownload",
    "8": "C&C-Torii",
    "9": "C&C-Mirai",
    "10": "C&C-HeartBeat-FileDownload",
    "11": "FileDownload",
    "12": "Okiru-Attack"
  },
  "known_classes": [
    "Benign",
    "C&C-HeartBeat",
    "DDoS",
    "Okiru"
  ],
  "unknown_primary": [
    "C&C",
    "Attack",
    "C&C-HeartBeat-Attack"
  ],
  "unknown_rare": [
    "C&C-FileDownload",
    "C&C-Torii",
    "C&C-Mirai",
    "C&C-HeartBeat-FileDownload",
    "FileDownload",
    "Okiru-Attack"
  ],
  "known_ids": [
    0,
    1,
    2,
    3
  ],
  "unk_primary_ids": [
    4,
    5,
    6
  ],
  "unk_rare_ids": [
    7,
    8,
    9,
    10,
    11,
    12
  ],
  "feature_cols": [
    "Telnet",
    "orig_byte_rate",
    "resp_ip_bytes",
    "Number",
    "Tot_sum",
    "Srate",
    "IAT",
    "HTTPS",
    "resp_pkts",
    "orig_pkts",
    "Rate",
    "orig_pkt_rate",
    "Max",
    "AVG",
    "resp_bytes",
    "ack_count",
    "orig_ip_bytes",
    "Magnitude",
    "Variance",
    "Std",
    "direction",
    "syn_count",
    "Radius",
    "duration",
    "byte_ratio",
    "IRC",
    "orig_bytes",
    "Min",
    "SSH",
    "fin_count",
    "rst_count",
    "HTTP",
    "fin_flag_number",
    "rst_flag_number",
    "conn_state_id",
    "history_id",
    "service_id"
  ],
  "n_features": 37,
  "samples_per_class": 23000
}